app/controllers/pages_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY category  [["user_id", 9999]]
---
  def all
    @tasks = Task.where(user_id: 9999).order('category')