app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY RANDOM() LIMIT $2  [["user_id", 9999], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."category" = $1 ORDER BY RANDOM() LIMIT $2  [["category", "Active"], ["LIMIT", 1]]
---
  def index
    @categories = ["Active", "Brainy", "Creative", "Social", "Relaxing", "All Categories"]
    if params[:category] == "All Categories"
      @winner  = Task.where(user_id: 9999).order("RANDOM()").first

    else
      @cat = params[:category]
      @winner = Task.where(category: @cat).order("RANDOM()").first